WelcomeText = \
    """\
Hi **%(first_name)s**, send me a file to instantly generate file links.

**Commands:**
/privacy - خصوصية البوت.
/log - سجلات البوت. (للمطور فقط)
/help - اظهار هذه الرسالة.
"""

PrivacyText = \
    """
# **سياسة الخصوصية**

## 1. تخزين البيانات
يتم حفظ الملفات التي تقوم بتحميلها/إرسالها بشكل آمن في القناة الخاصة للبوت على Telegram.

## 2. روابط التحميل
تحتوي الروابط على رمز سري لمنع الوصول غير المصرح به.

## 3. التحكم بالمستخدم
يمكنك إلغاء الروابط في أي وقت باستخدام زر "إلغاء".

## 4. الإشراف
يمكن لمالك البوت عرض وحذف ملفاتك إذا لزم الأمر.

## 5. مفتوح المصدر
البوت [مفتوح المصدر](https://github.com/TheCaduceus/FileStreamBot). يمكنك نشر نسختك الخاصة لتحقيق أقصى قدر من الخصوصية.

## 6. الاحتفاظ
يتم تخزين الملفات حتى تقوم بإلغاء روابطها.

**باستخدام هذا البوت، فإنك توافق على هذه السياسة.**
"""

FileLinksText = \
    """
**رابط التحميل:**
`%(dl_link)s`
"""

MediaLinksText = \
    """
**رابط التحميل:**
`%(dl_link)s`
**رابط التشغيل:**
`%(stream_link)s`
"""

InvalidQueryText = \
    """
حدث خطأ.
"""

MessageNotExist = \
    """
تم حذف الملف او ليس متوفر.
"""

LinkRevokedText = \
    """
تم حذف الملف سيأخذ بعض الوقت يرجى الانتظار
"""

InvalidPayloadText = \
    """
حدث خطأ
"""

UserNotInAllowedList = \
    """
ليس مسموح لك بإستخدام البوت 
"""
